In [1]:
#오류메시지를 무시하기위한 명령어
import warnings 
warnings.simplefilter(action='ignore')

In [2]:
import pandas as pd

In [3]:
#series =1차원배열, dataframe=2차원배열
from pandas import Series, DataFrame

In [4]:
import numpy as np  
np.random.seed(12345) 
#()아무값이나 넣어줘도됨. 난수발생시키는 seed값, seed가 같으면 같은 난수가 발생함, 재연성을 위해 입력

In [5]:
np.set_printoptions(precision=4, suppress=True)
#precision=4 === 소수점 4번째 자리까지
#suppress=True === 기본값은 False / True는 고정 소수점으로 표기

In [6]:
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10,6))

In [7]:
obj=pd.Series([4,7,-5,3])  
obj
#판다스의 series는 인덱스를 같이 출력
#넘파이의 series는 인덱스 숨겨져있음

0    4
1    7
2   -5
3    3
dtype: int64

In [8]:
obj.values  
#값들만 보고싶을 때
#자료형 numpy의 array형태

array([ 4,  7, -5,  3], dtype=int64)

In [9]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])  
obj2
#내가 인덱스값을 설정해주는것

d    4
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [12]:
obj2['a']

-5

In [13]:
obj2['d']=6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [15]:
obj2[obj2 >0]

d    6
b    7
c    3
dtype: int64

In [16]:
obj2 *2

d    12
b    14
a   -10
c     6
dtype: int64

In [17]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [18]:
'b' in obj2

True

In [19]:
'e' in obj2

False

In [20]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [21]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4
#결측치가 있는지 없는지

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [22]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [24]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [26]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
obj3 + obj4 
#둘다있는것만 더해짐

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [28]:
obj4.name = 'population'

In [29]:
obj4.index.name = 'state'

In [30]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [31]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [32]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [33]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003], 
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [34]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [35]:
frame.head() 
#위에서부터 5개만 보여줌

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [36]:
frame.tail() 
#맨끝에서5개만

   pop   state  year
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

In [37]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [38]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six']) 
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [39]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [40]:
frame2.loc['three']  
#index이름을 가지고 값들을 가져옴

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [41]:
frame2['debt']= 16.5

In [42]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [43]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [44]:
val = pd.Series([-1.2, -1.5, -1.7], 
                index=['two', 'four', 'five'])
frame2['debt'] = val 
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [45]:
frame2['eastern'] = frame2.state =='Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [46]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [47]:
pop = {'Nevada': {2001:2.4, 2002:2.9},
      'Ohio':{2000:1, 2001:1.7, 2002:3.6} }
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1, 2001: 1.7, 2002: 3.6}}

In [48]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.0
2001     2.4   1.7
2002     2.9   3.6

In [49]:
frame3.T  
#전치행렬

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.0   1.7   3.6

In [50]:
pdata = {'Ohio': frame3['Ohio'][:-1], 
         'Nevada': frame3['Nevada'][:2]} 
pd.DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.0
2001     2.4   1.7

In [52]:
frame3.index.name = 'year'
frame3.columns.name = 'state' 
frame3

state  Nevada  Ohio
year
2000      NaN   1.0
2001      2.4   1.7
2002      2.9   3.6

In [53]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [54]:
obj = pd.Series(range(3), index=['a', 'b', 'c']) 
index = obj.index 
index

Index(['a', 'b', 'c'], dtype='object')

In [55]:
index[1:]

Index(['b', 'c'], dtype='object')

In [56]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [57]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [58]:
obj2.index is labels

True

In [59]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.0
2001      2.4   1.7
2002      2.9   3.6

In [60]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [61]:
2003 in frame3.index

False

In [63]:
dup_labels = pd.Index(['foo', 'bear','foo','bar','bar'])
dup_labels
#중복이 되는지->중복가능

Index(['foo', 'bear', 'foo', 'bar', 'bar'], dtype='object')

In [64]:
####end